app/controllers/info_manager_controller.rb

SELECT `vt_infos`.* FROM `vt_infos` WHERE (`vt_infos`.student_id IN (3,4))
---
	def search_for_student
		if params[:last_name].nil?
			flash_redirect("Invalid search parameters", :action => "show")
		else
			@students = Student.all(:include => [:vt_info],
									:conditions => ["vt_infos.student_id_number = ? OR \
													vt_infos.student_pid = ? OR \
													last_name = ?",
													params[:student_id_number].strip,
													params[:student_pid].strip,
													params[:last_name].strip
													]
									)