app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `role`, `created_at`) VALUES('q', '595662500.329144159457913', '2010-08-08 08:23:39', '399123709eea990b849f45216bf13616db6965eb', NULL, '2010-08-08 08:23:39')
---
	def create
		@user = User.new(params[:user])
		respond_to do |format|
			if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `role` = 'edit', `updated_at` = '2010-08-08 08:28:33' WHERE `id` = 3
---
	def update
		@user = User.find(params[:id])
		respond_to do |format|
			if @user.update_attributes(params[:user])